Revit 2022 API
ElectricalSystemSet.Erase Method
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public virtual int Erase(
	ElectricalSystem item
)
Visual Basic
Public Overridable Function Erase ( _
	item As ElectricalSystem _
) As Integer
Visual C++
public:
virtual int Erase(
	ElectricalSystem^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Electrical.ElectricalSystem
See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace